Repository: tvbandroid/repositorio.tvbandroid
Catalog: piers/inputstream.adaptive/resources/language/resource.language.*/strings.po
Languages: bs_ba

# Addon Summary
source: InputStream client for adaptive streams
bs_ba: InputStream klijent za adaptivne tokove

# Addon Description
source: InputStream client for adaptive streams. Common streaming protocols such as MPEG-DASH, HLS and Microsoft Smooth Streaming are supported.[CR][CR]The add-on also has support for DRM protected streams, such as Google Widevine, Microsoft PlayReady and others.[CR][CR]For documentation visit: https://github.com/xbmc/inputstream.adaptive
bs_ba: InputStream klijent za adaptivne tokove. Podržani su uobičajeni protokoli tokinga kao što su MPEG-DASH, HLS i Microsoft Smooth Streaming.[CR][CR]Dodatak također ima podršku za DRM zaštićene tokove, kao što su Google Widevine, Microsoft PlayReady i drugi.[CR][CR]Za dokumentaciju posjetite: https://github.com/xbmc/inputtok.adaptive

# #30100
source: General
bs_ba: Općenito

# #30101
source: Minimum bandwidth (Kbps)
bs_ba: Minimalni propusni opseg (Kbps)

# #30102
source: Maximum bandwidth (Kbps)
bs_ba: Maksimalni propusni opseg (Kbps)

# #30103
source: Establishes the bandwidth limit not to be exceeded with the audio / video streams. Set to 0 to disable it.
bs_ba: Postavlja ograničenje propusnosti koje se ne smije prekoračiti audio/video tokovima. Postavite na 0 da biste ga onemogućili.

# #30110
source: Maximum resolution
bs_ba: Maksimalna rezolucija

# #30112
source: Type of media streams played
bs_ba: Vrsta reprodukovanih medijskih tokova

# #30113
source: Maximum resolution for DRM videos
bs_ba: Maksimalna rezolucija za DRM videozapise

# #30115
source: Ignore screen resolution
bs_ba: Negiraj rezoluciju ekrana

# #30116
source: If enabled, the screen resolution (or window size when in windowed mode) will no longer be considered when selecting the best video stream resolution when video starts and while in playback.
bs_ba: Ako je omogućeno, rezolucija ekrana (ili veličina prozora u režimu s prozorom) više se neće uzimati u obzir prilikom odabira najbolje rezolucije video toka kada se video pokrene i tokom reprodukcije.

# #30117
source: Manual stream selection mode
bs_ba: Ručni način odabira toka

# #30118
source: Defines which type of streams to make available for manual selection on Kodi OSD settings during playback.
bs_ba: Definira koje vrste tokova treba učiniti dostupnim za ručni odabir u postavkama Kodi OSD-a tokom reprodukcije.

# #30120
source: Expert
bs_ba: Stručno

# #30122
source: Disable secure decoder
bs_ba: Onemogući sigurni dekoder

# #30123
source: Some Android devices defined as Widevine L1, may not work properly, which may result in a black screen during playback. In this case try to enable it. This setting may be overridden by the video add-on used.
bs_ba: Neki Android uređaji definirani kao Widevine L1 možda neće ispravno raditi, što može rezultirati crnim ekranom tokom reprodukcije. U tom slučaju pokušajte ga omogućiti. Ovu postavku može poništiti korišteni video dodatak.

# #30156
source: Audio / Video streams
bs_ba: Audio / Video tokovi

# #30157
source: All
bs_ba: Sve

# #30160
source: Video streams
bs_ba: Video tokovi

# #30161
source: Video / Subtitles
bs_ba: Video / Titlovi

# #30162
source: Adaptive stream
bs_ba: Adaptivni tok

# #30167
source: WARNING: This is a TEST feature, may not work appropriately and may change on future versions.
bs_ba: UPOZORENJE: Ovo je TESTNA funkcija, možda neće ispravno raditi i može se promijeniti u budućim verzijama.

# #30168
source: Auto determines initial bandwidth
bs_ba: Automatski određuje početni propusni opseg

# #30169
source: If enabled, the bandwidth will be determined by the first download, however it may not be accurate. If the video quality at the start of playback is too low try disabling it.
bs_ba: Ako je omogućeno, propusnost će biti određena prvim preuzimanjem, međutim, možda neće biti tačna. Ako je kvalitet videa na početku reprodukcije prenizak, pokušajte ga onemogućiti.

# #30170
source: Initial bandwidth (Kbps)
bs_ba: Početni propusni opseg (Kbps)

# #30171
source: Defines the initial bandwidth when it cannot be automatically determined. This value can be overridden by the minimum bandwidth setting.
bs_ba: Definira početnu propusnost kada se ne može automatski odrediti. Ovu vrijednost može nadjačati postavka minimalne propusnosti.

# #30172
source: Resolution limit
bs_ba: Ograničenje rezolucije

# #30173
source: If set, based on the capabilities of the video stream an attempt will be made to limit the range of resolutions to the one chosen.
bs_ba: Ako je postavljeno, na osnovu mogućnosti video toka, pokušat će se ograničiti raspon rezolucija na odabranu.

# #30174
source: Stream selection type
bs_ba: Vrsta odabira toka

# #30175
source: Set how the audio / video streams quality will be chosen during playback. This setting may be overridden by the video add-on used. See Wiki for more information.
bs_ba: Postavite kako će se birati kvalitet audio/video tokova tokom reprodukcije. Ovu postavku može poništiti korišteni video dodatak. Za više informacija pogledajte Wiki.

# #30176
source: Adaptive (default)
bs_ba: Adaptivno (zadano)

# #30177
source: Manual OSD
bs_ba: Ručni OSD

# #30178
source: Fixed resolution
bs_ba: Fiksna rezolucija

# #30179
source: Ask quality
bs_ba: Pitajte za kvalitet

# #30200
source: Assured buffer duration (sec)
bs_ba: Zagarantovano trajanje bafera (sek)

# #30201
source: Maximum buffer duration (sec)
bs_ba: Maksimalno trajanje baferovanja (sekunde)

# #30202
source: Ignore screen resolution change
bs_ba: Negiraj promjenu rezolucije ekrana

# #30203
source: If enabled, the screen resolution (or window size when in windowed mode) will no longer be considered when selecting the best video stream resolution while in playback.
bs_ba: Ako je omogućeno, rezolucija ekrana (ili veličina prozora u režimu s prozorom) više se neće uzimati u obzir prilikom odabira najbolje rezolucije video toka tokom reprodukcije.

# #30204
source: Decrypter path
bs_ba: Putanja dekriptora

# #30209
source: Disabled
bs_ba: Onemogućeno

# #30231
source: Select video stream
bs_ba: Odaberite video tok

# #30232
source: Video stream {codec}{ [{hdr-type}]} {quality}
bs_ba: Video tok {codec}{ [{hdr-type}]} {quality}

# #30233
source: Test mode
bs_ba: Testni način rada

# #30234
source: Switch by segments
bs_ba: Prebacivanje po segmentima

# #30235
source: Segments
bs_ba: Segmenti

# #30236
source: Override settings
bs_ba: Poništi postavke

# #30237
source: Debug logging
bs_ba: Zapisivanje grešaka u zapisniku

# #30238
source: Save stream manifests
bs_ba: Sačuvaj manifeste toka

# #30239
source: Saves stream manifests downloaded during playback in the user data folder of InputStream Adaptive.
bs_ba: Sprema manifeste toka preuzete tokom reprodukcije u mapu korisničkih podataka InputStream Adaptive-a.

# #30240
source: Save license data
bs_ba: Sačuvaj podatke o licenci

# #30241
source: Saves the license data for example: initial data, challenge data and response data, in the "cdm" folder of the Kodi data folder.
bs_ba: Sprema podatke o licenci, na primjer: početne podatke, podatke o izazovu i podatke o odgovoru, u mapu "cdm" u mapi Kodi podataka.

# #30242
source: Enable verbose debug
bs_ba: Omogući detaljno otklanjanje grešaka

# #30243
source: Verbose debugging can be useful for debugging components, but in some cases it may expose sensitive information in the log.
bs_ba: Detaljno otklanjanje grešaka može biti korisno za otklanjanje grešaka komponenti, ali u nekim slučajevima može otkriti osjetljive informacije u dnevniku.

# #30300
source: InputStream Adaptive error
bs_ba: Greška adaptivnog InputStream-a

# #30301
source: Unable to play the stream.{[CR]Error: {error-details}}
bs_ba: Nije moguće reproducirati tok. {[CR]Greška: {error-details}}

# #30302
source: The decryptor path is not set in the add-on settings.
bs_ba: Putanja dekriptora nije postavljena u postavkama dodatka.

# #30303
source: A problem occurred with the DRM decryptor.
bs_ba: Došlo je do problema s DRM dekriptorom.

# #30304
source: Cannot load Widevine CDM library.
bs_ba: Nije moguće učitati Widevine CDM biblioteku.

# #30305
source: Cannot initialize Widevine CDM library.
bs_ba: Nije moguće inicijalizirati Widevine CDM biblioteku.

# #30306
source: The configuration to play the stream is incomplete or missing.
bs_ba: Konfiguracija za reprodukciju toka je nepotpuna ili nedostaje.

# #30307
source: Cannot download the stream manifest file.
bs_ba: Nije moguće preuzeti datoteku manifesta toka.

# #30308
source: A problem occurred in the stream initialization.
bs_ba: Došlo je do problema prilikom inicijalizacije toka.

# #30309
source: No audio/video stream can be played.
bs_ba: Nije moguće reprodukovati audio/video tok.
