Repository: tvbandroid/repositorio.tvbandroid
Catalog: piers/inputstream.adaptive-Piers/inputstream.adaptive/resources/language/resource.language.*/strings.po
Languages: es_es, zh_cn

# Addon Summary
source: InputStream client for adaptive streams
es_es: Cliente InputStream para transmisiones adaptativas
zh_cn: 用于自适应流的 InputStream 客户端

# Addon Description
source: InputStream client for adaptive streams. Common streaming protocols such as MPEG-DASH, HLS and Microsoft Smooth Streaming are supported.[CR][CR]The add-on also has support for DRM protected streams, such as Google Widevine, Microsoft PlayReady and others.[CR][CR]For documentation visit: https://github.com/xbmc/inputstream.adaptive
es_es: Cliente InputStream para transmisiones de datos adaptativos. Se admiten protocolos de transmisión comunes como MPEG-DASH, HLS y Microsoft Smooth Streaming.[CR][CR]El complemento también es compatible con transmisiones protegidas por DRM, como Google Widevine, Microsoft PlayReady y otros.[CR][CR]Para consultar la documentación, visite: https://github.com/xbmc/inputstream.adaptive
zh_cn: 用于自适应流的 InputStream 客户端。支持 MPEG-DASH、HLS 和 Microsoft Smooth Streaming 等常见流协议。[CR][CR]该插件还支持 Google Widevine、Microsoft PlayReady 等 DRM 保护流。[CR][CR]如需文档，请访问：https://github.com/xbmc/inputstream.adaptive

# #30100
source: General
zh_cn: 常规

# #30101
source: Minimum bandwidth (Kbps)
es_es: Ancho de banda mínimo (Kbps)
zh_cn: 最小带宽 （Kbps）

# #30102
source: Maximum bandwidth (Kbps)
es_es: Ancho de banda máximo (Kbps)
zh_cn: 最大带宽（Kbps）

# #30103
source: Establishes the bandwidth limit not to be exceeded with the audio / video streams. Set to 0 to disable it.
es_es: Establece el límite de ancho de banda que no se debe superar con las flujos de audio / vídeo. Establecer a 0 para desactivar.
zh_cn: 设置音频/视频流不超过带宽限制。设置为 0 将禁用它。

# #30110
source: Maximum resolution
es_es: Resolución máxima
zh_cn: 最大分辨率

# #30112
source: Type of media streams played
es_es: Tipo de transmisiones multimedia reproducidas
zh_cn: 播放的媒体流类型

# #30113
source: Maximum resolution for DRM videos
es_es: Resolución máxima para vídeos DRM
zh_cn: DRM 视频的最大分辨率

# #30115
source: Ignore screen resolution
es_es: Ignorar resolución de pantalla
zh_cn: 忽略屏幕分辨率

# #30116
source: If enabled, the screen resolution (or window size when in windowed mode) will no longer be considered when selecting the best video stream resolution when video starts and while in playback.
es_es: Si está activado, la resolución de la pantalla (o tamaño de ventana cuando está en modo ventana) ya no se considerará al seleccionar la mejor resolución de transmisión de vídeo cuando se inicie el vídeo y durante la reproducción.
zh_cn: 如果启用此选项，则在视频启动和播放时选择最佳视频流分辨率时，将不再考虑屏幕分辨率（或窗口大小）。

# #30117
source: Manual stream selection mode
es_es: Modo de selección manual de transmisión
zh_cn: 手动流选择模式

# #30118
source: Defines which type of streams to make available for manual selection on Kodi OSD settings during playback.
es_es: Define qué tipo de transmisiones estarán disponibles para la selección manual en los ajustes OSD de Kodi durante la reproducción.
zh_cn: 定义播放期间在 Kodi OSD 设置中手动选择哪种类型的流。

# #30120
source: Expert
es_es: Experto
zh_cn: 专家

# #30122
source: Disable secure decoder
es_es: Deshabilitar decodificador seguro
zh_cn: 禁用安全解码器

# #30123
source: Some Android devices defined as Widevine L1, may not work properly, which may result in a black screen during playback. In this case try to enable it. This setting may be overridden by the video add-on used.
es_es: Algunos dispositivos Android Widevine L1 pueden funcionar incorrectamente, causando una pantalla en negro durante la reproducción. En este caso intenta habilitarlo. Este ajuste puede ser cambiado por el addon de vídeo usado.
zh_cn: 某些被定义为 Widevine L1 的 Android 设备可能无法正常工作，这可能会导致播放过程中黑屏。在这种情况下，请尝试启用它。此设置可能会被使用的视频插件覆盖。

# #30156
source: Audio / Video streams
es_es: Transmisiones de audio y vídeo
zh_cn: 音频/视频流

# #30157
source: All
es_es: Todo
zh_cn: 全部

# #30158
source: Audio
zh_cn: 音频

# #30159
source: Video
es_es: Vídeo
zh_cn: 视频

# #30160
source: Video streams
es_es: Transmisiones de vídeo
zh_cn: 视频流

# #30161
source: Video / Subtitles
es_es: Vídeo / Subtítulos
zh_cn: 视频/字幕

# #30162
source: Adaptive stream
es_es: Transmisión adaptativa
zh_cn: 自适应流

# #30166
source: DRM Widevine
zh_cn: Widevine 数字版权管理

# #30167
source: WARNING: This is a TEST feature, may not work appropriately and may change on future versions.
es_es: ADVERTENCIA: Esta es una función en PRUEBAS, es posible que no funcione correctamente y que pueda cambiar en versiones futuras.
zh_cn: 警告:这是一个测试功能，可能无法正常工作，并且在未来的版本中可能会发生变化。

# #30168
source: Auto determines initial bandwidth
es_es: Determinar automáticamente ancho de banda inicial
zh_cn: 自动确定初始带宽

# #30169
source: If enabled, the bandwidth will be determined by the first download, however it may not be accurate. If the video quality at the start of playback is too low try disabling it.
es_es: Si está activado, el ancho de banda lo determinará la primera descarga; sin embargo, es posible que no sea exacto. Si la calidad del vídeo al inicio de la reproducción es demasiado baja, intente desactivarlo.
zh_cn: 如果启用，带宽将由第一次下载决定，但可能不准确。如果播放开始时的视频质量太低，请尝试禁用它。

# #30170
source: Initial bandwidth (Kbps)
es_es: Ancho de banda inicial (Kbps)
zh_cn: 初始带宽 (kbps)

# #30171
source: Defines the initial bandwidth when it cannot be automatically determined. This value can be overridden by the minimum bandwidth setting.
es_es: Define el ancho de banda inicial cuando no se puede determinar automáticamente. Este valor puede ser anulado por la configuración de ancho de banda mínimo.
zh_cn: 定义无法自动确定的初始带宽。最小带宽设置可以覆盖此值。

# #30172
source: Resolution limit
es_es: Límitar resolución
zh_cn: 分辨率限制

# #30173
source: If set, based on the capabilities of the video stream an attempt will be made to limit the range of resolutions to the one chosen.
es_es: Si se activa, dependiendo de las capacidades del flujo de vídeo, se intentará limitar el rango de resoluciones a la escogida.
zh_cn: 如果设置，将根据视频流的功能尝试将分辨率范围限制在选定的范围内。

# #30174
source: Stream selection type
es_es: Tipo de selección de transmisión
zh_cn: 流选择类型

# #30175
source: Set how the audio / video streams quality will be chosen during playback. This setting may be overridden by the video add-on used. See Wiki for more information.
es_es: Establezca cómo se elegirá la calidad de las transmisiones de audio y vídeo durante la reproducción. Esta configuración puede ser anulada por el complemento de vídeo utilizado. Consulte la Wiki para obtener más información.
zh_cn: 设置播放期间音频/视频流质量的选择方式。此设置可能会被使用的视频插件覆盖。更多信息请参考 Wiki。

# #30176
source: Adaptive (default)
es_es: Adaptativo (por defecto)
zh_cn: 自适应(默认)

# #30177
source: Manual OSD
es_es: OSD manual
zh_cn: 手动屏幕显示 OSD

# #30178
source: Fixed resolution
es_es: Resolución fija
zh_cn: 固定分辨率

# #30179
source: Ask quality
es_es: Solicitar calidad
zh_cn: 询问质量

# #30180
source: Test
es_es: Prueba
zh_cn: 测试

# #30200
source: Assured buffer duration (sec)
es_es: Duración del búfer garantizado (seg)
zh_cn: 保证缓冲区持续时间(秒)

# #30201
source: Maximum buffer duration (sec)
es_es: Duración máxima del búfer (seg)
zh_cn: 最大缓冲区持续时间（秒）

# #30202
source: Ignore screen resolution change
es_es: Ignorar cambio de resolución de pantalla
zh_cn: 忽略屏幕分辨率更改

# #30203
source: If enabled, the screen resolution (or window size when in windowed mode) will no longer be considered when selecting the best video stream resolution while in playback.
es_es: Si está activado, la resolución de la pantalla (o el tamaño de la ventana cuando está en modo ventana) ya no se considerará al seleccionar la mejor resolución de transmisión de vídeo durante la reproducción.
zh_cn: 若启用此选项，在播放时选择最佳视频流分辨率时，将不再考虑屏幕分辨率（或窗口模式下的窗口大小）。

# #30204
source: Decrypter path
es_es: Ruta descifrador
zh_cn: 解密器路径

# #30209
source: Disabled
es_es: Desactivado
zh_cn: 已禁用

# #30210
source: Auto
zh_cn: 自动

# #30231
source: Select video stream
es_es: Seleccionar transmisión de vídeo
zh_cn: 选择视频流

# #30232
source: Video stream {codec}{ [{hdr-type}]} {quality}
es_es: Flujo de vídeo {codec}{ [{hdr-type}]} {quality}
zh_cn: 视频流 {codec}{ [{hdr-type}]} {quality}

# #30233
source: Test mode
es_es: Modo de prueba
zh_cn: 测试模式

# #30234
source: Switch by segments
es_es: Cambiar por segmentos
zh_cn: 按片段切换

# #30235
source: Segments
es_es: Segmentos
zh_cn: 片段

# #30236
source: Override settings
es_es: Anular ajustes
zh_cn: 覆盖设置

# #30237
source: Debug logging
es_es: Registro de depuración
zh_cn: 调试日志记录

# #30238
source: Save stream manifests
es_es: Guardar manifiestos de transmisión
zh_cn: 保存流清单

# #30239
source: Saves stream manifests downloaded during playback in the user data folder of InputStream Adaptive.
es_es: Guarda los manifiestos de transmisión descargados durante la reproducción en la carpeta de datos del usuario de InputStream Adaptive.
zh_cn: 将播放时下载的流清单保存在 InputStream Adaptive 的用户数据文件夹中。

# #30240
source: Save license data
es_es: Guardar datos de licencia
zh_cn: 保存许可证数据

# #30241
source: Saves the license data for example: initial data, challenge data and response data, in the "cdm" folder of the Kodi data folder.
es_es: Guarda los datos de la licencia, por ejemplo: datos iniciales, datos de desafío y datos de respuesta, en la carpeta "cdm" de la carpeta de datos de Kodi.
zh_cn: 将许可证数据（例如：初始数据、挑战数据和响应数据）保存到 Kodi 数据文件夹的“cdm”文件夹中。

# #30242
source: Enable verbose debug
es_es: Activar registro detallado
zh_cn: 启用详细调试

# #30243
source: Verbose debugging can be useful for debugging components, but in some cases it may expose sensitive information in the log.
es_es: El registro detallado puede ser útil para analizar fallos de componentes, pero en algunos casos expone información sensible en el registro.
zh_cn: 详细调试对调试组件可能有用，但在某些情况下，它可能会在日志中暴露敏感信息。

# #30300
source: InputStream Adaptive error
es_es: Error de InputStream Adaptive
zh_cn: InputStream Adaptive 错误

# #30301
source: Unable to play the stream.{[CR]Error: {error-details}}
es_es: No se puede reproducir el flujo.{[CR]Error: {error-details}}
zh_cn: 无法播放流。{[CR]错误:{error-details}}

# #30302
source: The decryptor path is not set in the add-on settings.
es_es: No se ha configurado la ruta del desencriptador en los ajustes del Add-on.
zh_cn: 未在附加组件设置中设置解密程序路径。

# #30303
source: A problem occurred with the DRM decryptor.
es_es: Ocurrió un problema con el desencriptador DRM.
zh_cn: DRM 解密器出现问题。

# #30304
source: Cannot load Widevine CDM library.
es_es: No se puede cargar la librería Widevine CDM.
zh_cn: 无法加载 Widevine CDM 库。

# #30305
source: Cannot initialize Widevine CDM library.
es_es: No se puede inicializar la libreria Widevine CDM.
zh_cn: 无法初始化 Widevine 内容解密模块库。

# #30306
source: The configuration to play the stream is incomplete or missing.
es_es: La configuración para reproducir el flujo está incompleta o no existe.
zh_cn: 播放流的配置不完整或缺失。

# #30307
source: Cannot download the stream manifest file.
es_es: No se puede descargar el archivo manifest del flujo.
zh_cn: 无法下载流清单文件。

# #30308
source: A problem occurred in the stream initialization.
es_es: Ocurrió un problema al inicializar el flujo.
zh_cn: 流初始化过程中出现问题。

# #30309
source: No audio/video stream can be played.
es_es: No se puede reproducir ningún flujo audio/vídeo.
zh_cn: 无法播放音频/视频流。
